{
  "id": "2025-08-05-oracle-manipulation-attacks-hyperliquid-jelly",
  "status": "draft",
  "category": "defi",
  "date": "2025-08-05",
  "language": "zh-TW",
  "title": "當信使變成武器：預言機操控攻擊如何重新定義DeFi安全邊界",
  "content": "古希臘神話中，赫耳墨斯是眾神的信使，負責在天界與人間傳遞消息。這位信使的職責看似簡單——忠實地傳達信息，不添加、不刪減、不扭曲。但如果有一天，有人發現可以收買這位信使，讓他傳遞虛假的神諭，那會發生什麼？整個依賴神諭做決策的世界，都會因為一個被腐蝕的信使而陷入混亂。\n\n在DeFi的世界裡，預言機（Oracle）就是這樣的信使。它們負責將外部世界的價格信息傳遞到區塊鏈上，讓智能合約能夠根據真實的市場數據做出決策。但2025年3月，Hyperliquid平台上發生的JELLY代幣攻擊事件告訴我們：當信使被武器化，一場價值1200萬美元的災難就此上演。\n\n想像一下，你是一個小鎮的鐘錶師傅。每天早上，你都依賴鎮上唯一的大鐘來校準所有顧客的手錶。這個大鐘的時間來自三個信號源：火車站的報時、教堂的鐘聲，還有市政廳的時鐘。多年來，這套系統運行得很好，因為三個信號源相互驗證，確保時間的準確性。但有一天，一個聰明的騙子同時控制了火車站和教堂的時鐘，讓它們都顯示錯誤的時間。結果呢？整個小鎮的時間系統都被扭曲了，而你作為鐘錶師傅，在不知情的情況下，把錯誤的時間「修正」到了所有顧客的手錶上。\n\n表面上看，JELLY攻擊是一次針對低流動性代幣的價格操縱。但實際問題是：DeFi協議對外部數據源的信任機制存在系統性缺陷，而這種缺陷在流動性枯竭的情況下會被無限放大。\n\n**第一，預言機價格聚合通常是怎麼運作的？**\n\n大多數DeFi協議都採用類似的價格發現機制：從多個交易所收集價格數據，然後通過中位數或加權平均的方式計算出一個「公允價格」。這套機制的設計邏輯是統計學的：假設大部分數據源是誠實的，那麼通過數學方法就能過濾掉少數異常值。\n\n以Hyperliquid為例，它的標記價格計算公式是：Mark Price = Median(Price1, Price2, Last Traded Price)。其中Price1是指數價格加上資金費率調整，Price2是指數價格加上移動平均基差，而指數價格本身又來自多個現貨交易所的加權平均。這套複雜的計算看起來很科學，很安全。\n\n但問題在於，這套系統的安全性完全建立在一個假設之上：數據源足夠多、足夠獨立、足夠難以操控。對於Bitcoin、Ethereum這樣的主流資產，這個假設基本成立。但對於JELLY這樣的小幣種，日交易量不足200萬美元，在幾個關鍵交易所的流動性極其薄弱，這個假設就完全不成立了。\n\n攻擊者正是利用了這一點。他們發現，只需要在幾個流動性薄弱的交易所同時買入JELLY，就能讓價格在短時間內暴漲500%。而Hyperliquid的預言機系統，會忠實地記錄這個被操控的價格，並將其作為「市場真實價格」來觸發清算。\n\n**第二，怎樣才是比較好的預言機設計？**\n\n真正安全的預言機系統應該具備多層防護機制，而不僅僅依賴數學上的聚合算法。\n\n首先是異常值檢測機制。當某個價格數據偏離歷史均值超過一定閾值時，系統應該自動將其標記為可疑數據，並降低其在最終計算中的權重。比如，如果JELLY的價格突然從0.008美元跳到0.05美元，漲幅超過500%，系統應該意識到這可能是操控行為。\n\n其次是時間加權和波動性調整。不應該讓瞬間的價格波動立即影響關鍵決策，而是要通過時間加權平均價格（TWAP）來平滑短期異常。同時，對於流動性較差的資產，應該設置更保守的清算參數和更長的價格確認時間窗口。\n\n更重要的是動態風險管理。系統應該根據資產的流動性狀況動態調整其風險參數。對於像JELLY這樣的小幣種，應該限制其最大槓桿倍數，增加額外的安全邊際，並設置更嚴格的倉位監控機制。\n\nChainlink、Pyth這樣的去中心化預言機網路已經在這方面做了很多改進。它們不僅使用更多的數據源，還引入了聲譽機制和經濟激勵，讓數據提供者有動機提供準確的信息。\n\n**第三，為什麼大多數協議都會在預言機設計上犯錯？**\n\n這個問題的根源在於三個認知偏誤：技術樂觀主義、規模幻覺，以及風險外部化。\n\n技術樂觀主義讓開發者相信，只要算法設計得足夠精巧，就能解決所有信任問題。他們沉迷於數學模型的優雅，卻忽視了現實世界的複雜性。中位數算法在教科書上看起來很完美，但在面對協調攻擊時卻不堪一擊。\n\n規模幻覺讓協議團隊錯誤地認為，在Bitcoin上有效的機制在山寨幣上也同樣有效。他們看到主流交易所的深度訂單簿，就以為所有資產都有相似的流動性分佈。實際上，長尾資產的流動性分佈極度不均，幾個關鍵交易所就能決定價格走向。\n\n最致命的是風險外部化。當協議設計清算機制時，他們往往把最終的風險轉嫁給了流動性提供者或保險基金。在Hyperliquid的案例中，HLP金庫成為了攻擊者損失的最終承擔者。這種設計讓協議本身缺乏足夠的動機去完善風險控制，因為出了問題，損失是別人承擔的。\n\n更深層的原因是，DeFi行業仍然處於「技術至上」的思維模式中。大家都在比拼誰的算法更先進，誰的交易速度更快，誰的資本效率更高，卻很少有人願意花時間去思考極端情況下的風險管理。畢竟，設計複雜的風險控制機制既不性感，也不容易獲得市場關注。\n\n從博弈論的角度看，這是一個典型的「公地悲劇」。每個協議都希望在競爭中保持優勢，所以會盡可能地降低摩擦、提高效率，而風險管理往往被視為「必要的惡」。直到像JELLY這樣的攻擊發生，大家才意識到，沒有足夠安全邊際的高效系統，最終可能是最低效的。\n\n**結語：在信任與驗證之間找到平衡**\n\n俄國作家陀思妥耶夫斯基曾經說過：「如果上帝不存在，那麼一切都被允許。」在DeFi的世界裡，我們可以這樣理解：如果預言機不可信，那麼整個系統的安全假設都會崩塌。\n\nJELLY攻擊事件提醒我們，技術的進步不能替代對人性的深刻理解。再精巧的算法，也無法完全消除人類的貪婪和狡詐。真正的安全不僅來自代碼的完美，更來自對攻擊者心理的深刻洞察，以及對極端情況的充分準備。\n\n也許，我們需要承認一個不那麼性感但更加現實的事實：在一個去中心化的世界裡，完全的自動化和完全的安全可能是相互衝突的。最好的系統不是那些宣稱能夠自動處理一切的系統，而是那些在關鍵時刻知道何時需要人類介入的系統。\n\n當我們在追求更高效、更自動化的金融系統時，也許應該時不時地停下來問問自己：我們是在建造一個更好的世界，還是在為聰明的攻擊者準備更大的獵物？這個問題沒有標準答案，但值得每一個參與DeFi建設的人深思。",
  "references": [
    "https://www.panewslab.com/zh/articles/ef8850af-0ae4-46a3-b281-eba8a75682ca",
    "https://hyperliquid.gitbook.io/hyperliquid-docs/",
    "https://wifpr.wharton.upenn.edu/wp-content/uploads/2021/05/DeFi-Beyond-the-Hype.pdf",
    "https://www.oecd.org/daf/fin/financial-markets/Why-Decentralised-Finance-DeFi-Matters-and-the-Policy-Implications.pdf",
    "https://academic.oup.com/jfr/article/6/2/172/5913239",
    "https://blog.quicknode.com/hyperliquid-protocol-analysis-2025/",
    "https://coinshares.com/us/insights/research-data/the-great-leap-forward-dexs/"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": null,
  "social_hook": null,
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-05T12:00:00.000Z"
}