{
  "id": "2025-09-17-ethgas-infrastructure-financialization",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-09-18",
  "language": "en-US",
  "title": "When Ethereum starts selling seats: How ETHGas turns blockchain infrastructure into a Wall Street commodity",
  "content": "Have you ever found yourself wanting to dine at a popular restaurant, but you have no idea how long the wait will be, and the price fluctuates constantly? This is the reality of using Ethereum today. But a project called ETHGas claims to completely change the game.\n\nPANews recently reported on this eye-catching innovation, which claims to solve Ethereum's biggest pain point: high and unpredictable gas fees.\n\nThe report stated: \"The ultimate goal of ETHGas is to make gas fees completely 'disappear' from the user's perspective.\"\n\n[Gas fees are the fees required to conduct transactions on the Ethereum network, similar to bank transfer fees, but the price fluctuates dramatically depending on network congestion.]\n\nThis statement sounds technical, but it actually reveals a profound shift: ETHGas isn't just optimizing technology; it's redefining the business model of blockchain infrastructure.\n\n**First, how serious are Ethereum's current problems?**\n\nImagine that every time you send a WhatsApp message, it takes 12 seconds, and the fee fluctuates randomly from 1 to 100 dollars. This is the daily experience of Ethereum users today.\n\nData shows that Ethereum's average gas fee in 2025 was $1.85 [a significant drop from the peak in 2022, when complex transactions could cost over $95]. This seems reasonable, but the problem lies in its unpredictability. During periods of network congestion, a simple transfer can suddenly soar to over $50.\n\nEven worse is the confirmation time. Ethereum's block time is 12 seconds [the average interval between new blocks produced by the blockchain network], which is unacceptable for applications that require instant feedback. Imagine conducting arbitrage trading on a decentralized exchange; a 12-second delay is enough to eliminate any profit opportunities.\n\nETHGas's innovation lies in its \"millisecond pre-confirmation\" solution.\n\nThe report emphasized: \"ETHGas reduces transaction times from 12 seconds to 3 milliseconds, achieving a 4,000-fold performance improvement.\"\n\n[Pre-confirmation refers to the fact that validators provide finality guarantees before a transaction is officially uploaded to the blockchain, similar to a restaurant giving you a reservation confirmation before you're seated.]\n\nThis isn't just a technical optimization; it's a fundamental innovation in the business model. ETHGas is effectively creating a \"blockchain futures market.\"\n\n**Second, what does it mean to \"turn blockchain infrastructure into a Wall Street commodity\"?**\n\nThis reveals a counterintuitive insight: while ETHGas appears to be solving a technical problem, it's actually introducing financial market mechanisms.\n\nTraditional blockchains operate on a \"first-come, first-served\" or \"highest bidder\" basis, which is fair but unpredictable. ETHGas's approach is to turn block space (block space refers to the number of transactions each block can accommodate, similar to the number of seats in a restaurant) into a tradable commodity.\n\nThe report mentions ETHGas' four core strategies:\n\n1. Millisecond Pre-Confirmation: Reducing transaction times from 12 seconds to 3 milliseconds\n2. Financialization of Blockspace: Creating exchanges for transaction confirmation\n3. Providing stable income for validators: Through the \"Commit Boost\" module\n4. Providing gas fee rebates to users: Through participating dApps\n\n[Validators are computers that maintain the security of the blockchain network, similar to bank branches, responsible for processing and confirming transactions.]\n\nThe beauty of this model lies in creating a win-win situation, but it also introduces the complexity of Wall Street.\n\nThink about it: when you can \"reserve\" a trading position on a specific block in advance, you are essentially trading \"future computing resources.\" This is essentially no different from oil or wheat futures; both involve trading the right to future commodity delivery. Here's how it works: 1. Pre-confirmation Market: Validators can pre-sell specific trading positions in the blocks they're about to package. For example, if a validator knows their block will be mined in 30 seconds, they can immediately sell the \"priority\" for the first 10 transactions in that block. 2. Price Discovery Mechanism: Like a stock exchange, buyers and sellers determine the price of each block position through bidding. Traders who need to execute arbitrage urgently are willing to pay high prices, while regular transfers can wait for lower prices. 3. Risk Management Tools: Institutions can purchase \"gas fee insurance\" or \"delay compensation.\" If network congestion causes cost overruns, the insurance will cover the shortfall. 4. Derivatives Markets: You can even short gas fees. If you believe Ethereum will be idle next month, you can sell blockspace for that period in advance.\n\nMore importantly, ETHGas has partnered with BTCS (a publicly listed blockchain infrastructure company) to become a \"priority builder.\" This means they are not just a technical service provider, but a \"wholesaler\" of infrastructure. This \"wholesaler\" model is very similar to the market maker system on Wall Street. ETHGas purchases blockspace in bulk from validators, then splits it into smaller portions and sells them to end users. They profit from the price difference and also bear inventory risk. If the blockspace purchased during a certain period cannot be sold, ETHGas suffers a loss.\n\n**Third, why do most people misunderstand this innovation?**\n\nMany people believe that ETHGas is just another \"scaling solution,\" but this completely misses the point.\n\nThe revolutionary nature of ETHGas lies not in making Ethereum faster, but in making it more like traditional financial markets. This transformation carries both opportunities and risks.\n\n**Opportunity Meeting:**\n\n1. **Dramatically Improved User Experience**: 3-millisecond confirmation times make blockchain applications feel as smooth as traditional apps.\n2. **Cost Predictability**: The specific mechanism here is crucial. ETHGas effectively creates a \"blockspace futures exchange,\" where businesses can purchase the right to confirm future transactions at a fixed price months in advance, similar to how airlines purchase fuel. For example, a DeFi protocol can lock in all transaction costs for the next six months at $0.50 per transaction in January. Even if gas prices soar to $5 in the summer, their costs will still be $0.50.\n3. **New Business Model**: Developers can cover gas fees for users and profit through other means.** More importantly, ETHGas creates a win-win ecosystem for all parties: **Validators/Staking Nodes (Sellers)**: No longer limited to earning staking rewards and relying on MEV [MEV refers to Miner Extractable Value, the additional income validators can earn by reordering transactions]. Now, through ETHGas' \"Commit Boost\" module, they can treat their block space as a high-end commodity and sell it to institutional buyers on exchanges. This provides stable and higher additional income, opening up the possibility of \"fixed-rate staking,\" dramatically increasing its appeal to large institutional funds. **Traders/Protocols (Buyers):** No longer need to build complex infrastructure to grab blocks. Now, you can directly purchase \"certainty\" with money on the exchange. Front-running trades, emergency liquidations, oracle updates...all time-sensitive operations can be handled with money, greatly improving efficiency and success rates. **dApps/Protocols (User Growth):** Exchanges have made gas costs predictable and hedging-friendly (through futures), allowing dApps to finally waive gas fees for their users. Gas-free transactions can attract a large number of users, which naturally leads to a surge in transaction volume and, consequently, a surge in the value of block space. **Ordinary users (the ultimate beneficiaries)**: The most direct benefit is gas rebates. When you trade on a partnered dApp, ETH Gas is reimbursed for your transactions. It's like a \"cashback network\" for online life, saving money on every transaction.\n\n**Risks:**\n\n1. **Centralization Propensity**: Complex financial mechanisms could give large institutions an advantage over individual users.\n2. **Financialization Risk**: When infrastructure becomes a speculative commodity, a derivatives bubble similar to the 2008 financial crisis could emerge.\n3. **Technical Complexity**: More intermediaries mean more potential points of failure.\n\nThe key insight is that ETHGas represents a significant shift in blockchain thinking, from \"decentralization purism\" to \"utility optimization.\"\n\nSuch shifts are not uncommon in the history of cryptocurrencies. Bitcoin's original ideal was \"peer-to-peer electronic cash,\" but it is now primarily viewed as \"digital gold.\" Ethereum has evolved from a \"world computer\" to a \"decentralized financial infrastructure.\"\n\nThe emergence of ETHGas hints at the next stage of evolution: \"Blockchain as Financial Market.\"\n\n**Fourth, what does this mean for ordinary users?**\n\nIn the short term, if ETHGas is successfully deployed, users will experience:\n\n1. **Instant transaction confirmation**: No more 12-second waits\n\n2. **Predictable fees**: Applications can cover gas costs for users\n\n3. **Better DeFi experience**: Complex transactions no longer worry about failure\n\nHowever, in the long term, this could shift the power structure of the entire blockchain ecosystem.\n\nWhen infrastructure becomes a tradable commodity, participants with more capital gain greater advantages. This could potentially recreate the inequalities of the traditional financial system.\n\nHowever, it also has the potential to create a larger pool of value, benefiting all participants. The key lies in whether the design can maintain a relatively fair barrier to entry.\n\n**Conclusion: When Blockchain Meets Wall Street**\n\nThe story of ETHGas reminds us that the most successful innovations are often not the most \"pure\" but the most \"practical.\"\n\nAs we pursue our ideal decentralized world, perhaps true breakthroughs come from pragmatic compromises. ETHGas's transformation of blockchain infrastructure into a Wall Street commodity may seem like a betrayal of the original purpose of cryptocurrency, but it may also be a necessary step towards achieving mass adoption.\n\nAfter all, blockchain technology can only truly become part of everyday life when ordinary users no longer need to worry about gas fees and confirmation times. This goal is perhaps more important than maintaining the \"purity\" of the technology.\n\nThroughout this process, we must remain vigilant to ensure that technological advancements do not replicate the shortcomings of the traditional financial system. At the same time, we should also embrace innovations that can truly improve the user experience, even if they appear \"less decentralized.\"\n\nThe success or failure of ETHGas will be a crucial litmus test for the viability of this pragmatic approach. Its impact could extend far beyond the technical realm, redefining our vision of the blockchain future.",
  "references": [
    "https://www.panewslab.com/zh/articles/e565185f-b829-4a1f-bcdc-cf32fd327c2a",
    "https://ethereum.org/en/developers/docs/gas/",
    "https://docs.ethgaslabs.com/",
    "https://eips.ethereum.org/EIPS/eip-4844",
    "https://ethereum.org/en/roadmap/danksharding/",
    "https://notes.ethereum.org/@vbuterin/proto_danksharding_faq",
    "https://ethresear.ch/t/based-preconfirmations/17353",
    "https://ethereum.org/en/developers/docs/consensus-mechanisms/pos/",
    "https://docs.btcs.com/",
    "https://ultrasound.money/",
    "https://l2beat.com/",
    "https://dune.com/hildobby/gas-prices"
  ],
  "framework": "解讀分析式風格.md",
  "audio_file": "audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization.wav",
  "social_hook": "🎫 Ethereum is selling seats! ETHGas aims to reduce 12-second wait times to 3-millisecond confirmations, but this isn't just a technical upgrade—it's...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-18T08:01:58.606Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment070.ts"
    ]
  }
}