{
  "id": "2025-07-03-circle-valuation-digital-dollar",
  "status": "translated",
  "category": "macro",
  "date": "2025-07-05",
  "language": "en-US",
  "title": "Behind Circle’s $58.2 billion valuation: The geopolitical game of digital dollar infrastructure",
  "content": "Have you ever wondered why a company that issues stablecoins has a higher market value than many traditional banks? Circle's recent IPO valuation of $58.2 billion set a record in the cryptocurrency industry. But behind this number lies a global competition for the future financial infrastructure.   Not just a valuation game, but a comparison of monetary sovereignty Let's first understand this amazing valuation. Circle's price-to-earnings ratio is 8 times higher than Visa, which means that investors are not buying for the present, but betting on a brand new financial future. In this future, digital dollars will penetrate payment systems in every corner of the world. Circle's business model is actually very simple: they issue USDC stablecoins, and then invest the US dollars deposited by users in safe assets such as short-term US Treasury bonds to earn interest income. This model makes Circle extremely sensitive to the interest rate policy of the US Federal Reserve-more than 95% of its income comes from this interest income. But what's really interesting is that this seemingly simple business model is actually redefining what a \"digital dollar\" is. When you use USDC for cross-border payments, you are actually using a digital currency issued by a private company but backed by US government bonds.   Regulatory compliance: the moat of the new era 2024 is the watershed for stablecoin regulation. The EU's MiCA regulation officially came into effect on June 30, and Circle became the first fully compliant large-scale stablecoin issuer. This is not just a license, but more like an \"identity card\" in the digital financial era. In contrast, although the market leader Tether's USDT has a higher market share (62.1% vs 24.2%), there has been controversy over regulatory transparency. This comparison has become increasingly important because European exchanges have begun to delist USDT, and Coinbase no longer supports USDT transactions in the EU. The essence of this compliance competition is to ask a fundamental question: Who is qualified to issue \"quasi-dollars\" in the digital financial era? Circle's answer is: only those institutions that are fully regulated and operate transparently.   The secret of capital efficiency: speed is everything Although the total supply of USDT is nearly three times higher than that of USDC, there is one surprising data: the capital turnover speed of USDC is 2.81 times that of USDT. What does this mean? Every dollar of USDC is used almost three times as often as USDT. This difference reflects two different usage patterns. USDT is more used for storage and speculative trading, while USDC is increasingly becoming the first choice for institutions and DeFi applications. On the Solana blockchain, USDC accounts for 99.5% of stablecoin trading volume; on Arbitrum, USDC has even achieved a \"turnaround\" against USDT. Behind this high capital efficiency is the preference of institutional users for compliance and transparency. When a multinational enterprise needs to make cross-border payments, using regulated USDC is more in line with its risk management requirements than using USDT, which has an unclear regulatory status.   Cross-border payments: $27.6 trillion opportunity In 2024, the total transaction volume of stablecoins reached $27.6 trillion, exceeding the sum of Visa and Mastercard. Among them, the transaction volume of stablecoins dedicated to payments was $6.3 trillion, equivalent to 15% of the total global retail cross-border payments. The traditional cross-border payment system has obvious flaws: nearly a quarter of global payment corridors cost more than 3%, and a third of retail cross-border payments take more than one business day to settle. In contrast, using USDC to transfer through the Solana blockchain usually costs less than $0.01 and the settlement time does not exceed 5 seconds. This efficiency advantage is driving institutional adoption. PayPal’s Xoom began using the PayPal USD stablecoin to speed up remittances in 2024; Visa launched a tokenized asset platform; even the Bank of America announced plans to launch its own stablecoin.   The undercurrent of geopolitics: the double-edged sword of digital dollarization However, there is a deeper question here: when dollar stablecoins such as USDC become popular around the world, what impact will it have on the monetary sovereignty of various countries? The International Monetary Fund warns that stablecoins \"may encourage dollarization\" and make countries lose control of monetary policy. When a country's economy becomes increasingly dependent on foreign currencies (in this case, digital dollars), the ability of the country's central bank to influence the local economy will be weakened. This concern has caused a divided reaction among central banks:  US strategy : The Trump administration has made it clear that it prioritizes the development of stablecoins as a mechanism to maintain the dollar's global reserve currency status. Federal Reserve Governor Christopher Waller publicly supports stablecoins because they \"could expand the dollar's reserve currency status.\"  EU defense : The European Central Bank takes the opposite stance, worrying about the threat of crypto assets to the financial stability of the eurozone. The EU's MiCA regulations actually provide incentives for other jurisdictions to \"not interoperate with non-Euro stablecoins\", essentially protecting the EU's economic and monetary sovereignty.  Small countries’ response : Many smaller countries are accelerating the development of central bank digital currencies (CBDCs) to prevent dollarization. By March 2024, central banks in 134 countries, accounting for 98% of global GDP, are evaluating the launch of national digital currencies.   Investment logic: betting on the future of digital finance Circle’s $58.2 billion valuation is actually a collective bet by the market on three trends: 1.  Digital transformation of financial infrastructure : The traditional banking system will gradually be supplemented or replaced by blockchain-native payment channels. 2.  The value premium of regulatory compliance : In an increasingly tightening regulatory environment, compliance will become the most important competitive advantage. 3.  Digital extension of US dollar hegemony : The United States has extended the influence of the US dollar to the digital economy through stablecoins such as USDC.   Risks and opportunities coexist But this story also has risks. Circle's business model is highly dependent on the interest rate environment-when the Fed cuts interest rates, its interest income will be directly damaged. To cope with this risk, Circle must accelerate the development of transaction volume-based revenue sources. In addition, geopolitical risks cannot be ignored. If governments begin to restrict the use of foreign stablecoins or promote local CBDCs to fight \"digital dollarization\", Circle's global expansion may face resistance.   Conclusion: The beginning of a new financial order Circle's listing is not only the success of a company, but also symbolizes the beginning of a new financial order. In this order, traditional banks, government currencies, and international payment systems will face challenges from blockchain native infrastructure. For global investors, Circle provides a unique opportunity: to participate in the digital asset revolution through traditional stock markets. For governments, the success of USDC raises an urgent question: how to protect their own monetary sovereignty while embracing financial innovation? The competition around digital dollar infrastructure has just begun. Regardless of the final outcome, we are witnessing an important turning point in financial history. At this inflection point, technological innovation, regulatory policy, and geopolitical forces are reshaping our understanding of the nature of money.",
  "references": [
    "https://www.panewslab.com/zh/articledetails/oase5yr3.html",
    "https://en.cryptonomist.ch/2024/07/01/circle-usd-coin-usdc-is-the-first-stablecoin-to-comply-with-mica-regulation/",
    "https://www.circle.com/circle-eea",
    "https://coinmetrics.substack.com/p/state-of-the-network-issue-307",
    "https://www.fireblocks.com/report/state-of-stablecoins/",
    "https://beincrypto.com/circle-us-bank-move-usdt-dominance-shift/",
    "https://www.coindesk.com/business/2024/04/24/tethers-stablecoin-dominance-may-wane-following-proposed-us-rules-sp",
    "https://www.atlanticcouncil.org/blogs/econographics/central-bank-digital-currencies-versus-stablecoins-divergent-eu-and-us-perspectives/",
    "https://www.ledgerinsights.com/cbdc-dollarization-monetary-sovereignty-ecb-forum/",
    "https://www.grandviewresearch.com/industry-analysis/cross-border-payments-market-report"
  ],
  "audio_file": "audio/en-US/macro/2025-07-03-circle-valuation-digital-dollar.wav",
  "social_hook": "🚀 Circle's $8.2B valuation isn't just about stablecoins—it's about who controls the future of digital dollars. While USDC challenges traditional banking, it's also sparking a global battle for monetary sovereignty. The digital finance revolution is here.\n\nEng | 中 | 日 podcasts on Apple Podcasts, Spotify",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-05T11:39:03.544Z"
}