{
  "id": "2025-01-09-stablecoin-dollar-hegemony-financial-revolution",
  "status": "translated",
  "category": "macro",
  "date": "2025-09-11",
  "language": "en-US",
  "title": "When Stable Currency Becomes a Financial Weapon: Arthur Hayes's View of the New Strategy of US Dollar Hegemony",
  "content": "The ancient Greek philosopher Heraclitus once said, \"You cannot step into the same river twice.\" But in the world of finance, we often face a more interesting phenomenon: when the old river is about to dry up, the wise have already begun to dig new channels. Today, as we discuss Arthur Hayes's argument that stable currencies will reshape the global financial landscape, we may be witnessing the largest \"rerouting project\" in history.\n\nImagine this scenario: Your friend Xiao Ming works in the Philippines and needs to send money back to his parents back home every month. Traditionally, he would have to go to a local bank, fill out complicated forms, pay high fees, and wait three to five business days for the money to reach his family, all while facing the risk of exchange rate fluctuations. But what if, one day, Xiao Ming could instantly transfer funds using the USDC stablecoin with just a few taps on his phone, with a fee of less than $1, and his parents would receive the funds immediately, with the entire process transparent and traceable? This would be a microcosm of the stablecoin revolution described by Arthur Hayes.\n\nOn the surface, Hayes is discussing a financial technology innovation; the real problem is that stablecoins are becoming a new strategic weapon for the United States to maintain its global financial hegemony, a \"Trojan Horse\" that could redefine the distribution of financial power in the 21st century.\n\nFirst, how does the traditional global dollar system typically operate?\n\nThe current international dollar system is built on a complex, multi-layered structure, which we call the \"Eurodollar market.\" This market is worth $93 trillion, with non-US banks holding $15 trillion in dollar deposits and daily trading volume ranging from $50 billion to $200 billion. This vast system functions like a vast network of pipes, channeling dollars around the world through the SWIFT system, correspondent banking relationships, and a complex interbank lending network.\n\nHowever, this system has significant limitations: first, time constraints—banks are only open on weekdays, and cross-time zone transfers often require waiting. Second, costs—each layer of intermediaries charges fees, and the cost of an international transfer can be as high as 5-10% of the transfer amount. Most crucially, access is difficult—1.4 billion adults worldwide, or 17%, lack bank accounts and are completely excluded from the system.\n\nA deeper problem lies in the system's geopolitical fragility. When the United States wishes to impose sanctions on a country, it can simply sever its connection to the SWIFT system, effectively isolating it from the global financial system. The Western SWIFT sanctions against Russian banks during the Russo-Ukrainian war are a prime example. The power of this \"financial nuclear weapon\" has led many countries to seek alternatives.\n\nAnother structural problem with the Eurodollar system is the complexity of liquidity management. When the global economy faces a crisis, the Federal Reserve needs to provide dollar liquidity to other central banks through a complex system of currency swap agreements. We saw this mechanism in action during the 2008 financial crisis and the 2020 COVID-19 pandemic, but it remains dependent on political will and bilateral agreements, lacking automation and universal access.\n\n**Second, what revolutionary alternative does a stablecoin offer?**\n\nArthur Hayes believes that a stablecoin represents a more efficient and inclusive approach to dollar globalization. The global stablecoin market currently exceeds $200 billion, and 80% of dollar-backed stablecoin transactions occur outside the United States. This data speaks volumes: global demand for dollars is real, but the traditional banking system is failing to effectively meet this demand.\n\nThe core advantage of stablecoins lies in their ability to bypass the layers of intermediaries in the traditional financial system. When you use USDC or USDT to make a cross-border transfer, you are effectively transferring digital dollar value directly on the blockchain, without going through any bank or payment processor. This \"disintermediation\" brings three key benefits: 24/7 availability, extremely low transaction costs (typically less than $1), and near-instant settlement speeds.\n\nMore importantly, stablecoins offer the potential for financial inclusion. In countries with unstable currencies, such as Argentina, Turkey, and Nigeria, citizens are already using stablecoins as a store of value and payment method. With only a smartphone and an internet connection, they can access financial services that are more stable and cheaper than those offered by their local banks. The impact of this \"financial democratization\" is profound—it allows dollar-denominated services to reach the 1.4 billion unbanked population that traditional banking systems cannot reach.\n\nFrom a US strategic perspective, stablecoins resolve a paradox that has long plagued the dollar's hegemony: how to expand the global circulation of the dollar without losing control. While the traditional Eurodollar system is vast, the US has limited control over it, as these dollars are primarily held and managed by foreign banks. Stablecoins, on the other hand, are different. Major stablecoin issuers, such as Circle (USDC) and Tether (USDT), are required to hold an equivalent amount of US Treasury bonds or bank deposits as reserves, effectively directing global demand for dollars directly into the US financial system.\n\nThe ingenuity of this mechanism lies in the creation of a \"positive feedback loop\": greater global demand for stablecoins leads to greater demand for US Treasury bonds, which in turn makes it easier for the US government to finance its debt. Simultaneously, the widespread use of stablecoins strengthens the dollar's position as the global standard of value and medium of exchange, further consolidating its hegemony.\n\n**Third, why do most people misunderstand the strategic significance of stablecoins?**\n\nMisunderstanding the strategic significance of stablecoins stems primarily from three cognitive biases: technological myths, regulatory panic, and a misunderstanding of the nature of financial evolution.\n\nFirst, the trap of \"technological myths.\" Many view stablecoins as purely cryptocurrency innovations, focusing on concepts like blockchain technology, smart contracts, and decentralization. But this perspective completely misses the point. The true power of stablecoins lies not in the technology itself, but in the way they reshape the political economy of global dollar circulation. Much like the value of the internet lies not in the technical details of the TCP/IP protocol, but in how it has transformed information dissemination and business models.\n\nSecondly, there's the impact of \"regulatory panic.\" Whenever regulators express concerns about stablecoins, the market often interprets it as a signal that the government wants to ban them. But in reality, the EU's MiCA regulations and the federal framework under consideration in the US both point in one direction: how to regulate and integrate stablecoins, not eliminate them. Smart regulators have realized that rather than fighting this trend, it's better to integrate them into the existing financial system and benefit from them.\n\nBehavioral economics teaches us that when faced with complex new phenomena, people tend to use familiar frameworks to understand them. On the issue of stablecoins, traditional finance practitioners tend to view them as a \"bank deposit substitute,\" while cryptocurrency believers see them as part of a \"decentralized monetary revolution.\" However, both perspectives are one-sided. Stablecoins are neither simple deposit substitutes nor revolutionary tools against governments. Rather, they are a new type of monetary infrastructure that has the potential to strengthen, rather than weaken, the existing monetary order.\n\nThe most profound misunderstanding lies in the understanding of the nature of \"financial power.\" Many believe that financial power derives from controlling the issuance of money, but modern monetary theory teaches us that true power lies in controlling the demand for money. The US maintains its dollar hegemony not because it monopolizes the printing of dollars (in reality, most dollars are created by commercial banks through lending), but because the world relies on the dollar for trade, as a store of value, and for pricing. Stablecoins do not challenge this demand structure; rather, by reducing the friction costs of using the dollar, they increase global demand for it.\n\nIn his research on the optimal currency area theory, Nobel laureate Robert Mundell pointed out that the competitiveness of a currency depends on its network effects and ease of use. From this perspective, stablecoins are not a threat to the dollar, but rather an amplifier of the dollar's network effects. They allow more people to use the dollar more conveniently, thereby strengthening its network value.\n\nOf course, this process also introduces new risks. Synthetic stablecoin projects like Ethena, while offering innovative revenue mechanisms, also introduce complex financial engineering risks. Ethena currently accounts for 14% of open interest in the Ethereum futures market. This concentration, if not managed properly, could pose systemic risks. However, these are issues of implementation details, not the concept of stablecoins itself.\n\n**Conclusion: When the River Changes Its Course**\n\nReturning to the wisdom of Heraclitus, perhaps the true insight lies in understanding the nature of change. The stablecoin revolution may appear to challenge the traditional financial system, but in reality it may be an evolutionary upgrade of the US dollar's hegemony. Just as the internet didn't eliminate commerce but instead created more efficient business models, stablecoins won't eliminate national currencies; instead, they may create more efficient monetary circulation mechanisms.\n\nArthur Hayes's insights remind us that when evaluating financial innovations, we must look beyond the surface technology and understand the underlying power logic and strategic implications. When 1.4 billion unbanked people access financial services through stablecoins, they aren't using some kind of \"decentralized currency\" but a new form of the US dollar. This dollar is cheaper, faster, and more ubiquitous, but it's still the US dollar.\n\nPerhaps the real question isn't whether stablecoins will succeed, but rather who will emerge as the new beneficiaries and who will be marginalized in this upgrade of financial infrastructure. For those who understand this, the stablecoin revolution presents both an opportunity and a challenge. The key lies in whether we choose to stand by the old river's path and wait for it to dry up, or follow the current in a new direction.",
  "references": [
    "https://www.panewslab.com/zh/articles/e60dc672-7e15-4a4b-903c-fbabccb45d09",
    "https://en.wikipedia.org/wiki/Eurodollar",
    "https://libertystreeteconomics.newyorkfed.org/2024/05/who-is-borrowing-and-lending-in-the-eurodollar-and-selected-deposit-markets/",
    "https://www.statista.com/statistics/1246963/unbanked-population-in-selected-countries/",
    "https://blog.cfte.education/the-worlds-top-5-unbanked-countries-have-more-than-60-of-their-population-without-bank-accounts/",
    "https://docs.ethena.fi/solution-overview/risks",
    "https://www.coindesk.com/business/2024/04/18/usde-holders-should-monitor-ethenas-reserve-fund-to-avoid-risk-cryptoquant-warns",
    "https://www.elliptic.co/blog/regulatory-outlook-2024-stablecoins-will-be-atop-the-regulatory-and-policy-agenda",
    "https://www.spglobal.com/ratings/en/research/articles/250210-stablecoin-regulation-gains-global-momentum-13400761",
    "https://www.americanbar.org/groups/business_law/resources/business-law-today/2024-september/state-stablecoin-regulation-emergence-global-principles/"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution.wav",
  "social_hook": "🌊 When US dollar hegemony meets the stablecoin revolution! Arthur Hayes predicts: The old rivers are drying up, and a new financial order is...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-11T08:11:57.116Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-01-09-stablecoin-dollar-hegemony-financial-revolution/segment066.ts"
    ]
  }
}