{
  "id": "2025-07-03-bis-unified-ledger-battle",
  "status": "translated",
  "category": "macro",
  "date": "2025-07-05",
  "language": "en-US",
  "title": "The unified ledger showdown of international clearing banks: the battle for sovereignty over central bank digital currencies",
  "content": "Have you ever thought about why the world's most authoritative central bank alliance chose a completely different path from Bitcoin and Ethereum when they began to seriously design the future of digital finance? Today we are going to talk about a key battle that is reshaping the global financial infrastructure: the \"unified ledger\" concept of the Bank for International Settlements (BIS) versus the decentralized public chain world. This is not just a battle of technical routes, but also the ultimate competition for control over the future financial system.   Project Agorá: Digital Finance Manifesto of the Central Bank Alliance On June 29, 2025, the BIS released its annual economic report, which detailed the blueprint of the \"Unified Ledger Trilogy\": tokenized central bank reserves, tokenized commercial bank funds, and tokenized government bonds. This is not just talk on paper, but a practical project involving seven major central banks. Project Agorá brings together the Federal Reserve New York Branch, the Bank of England, the Bank of Japan, the Swiss National Bank, the Bank of France, the Bank of Korea, and the Central Bank of Mexico. Even more striking is that 41 private institutions have also joined the experiment, including Visa, Mastercard, Swift, and major banks in various countries. The core innovation of this project is to integrate message delivery, reconciliation and settlement into a single seamless operation. In other words, the KYC and compliance checks that are required to be repeated by multiple intermediaries in traditional cross-border payments will be completed once on a unified ledger, greatly improving efficiency. But here comes the problem: this system is fully licensed and strictly controlled by the central bank and regulators. Every transaction and every participant must be approved in advance.   The fundamental difference between the two worlds At the same time, the public chain world is taking a completely different path. Public chains such as Ethereum and Solana provide permissionless global financial infrastructure that anyone can participate in without the approval of the central bank. Cross-chain bridge protocols such as Chainlink CCIP are building a multi-chain interconnected financial network. This contrast reveals two very different visions of future finance:  Unified ledger model : a single, trusted network governed by a central bank alliance, emphasizing stability, compliance, and policy control.  Multi-chain public chain model : a diversified, trust-minimized network ecosystem that emphasizes innovation, openness, and censorship resistance. This is not just a technical choice, but also a political economic choice. The former maintains the existing monetary sovereignty system, while the latter challenges the foundation of this system.   China's DCEP strategic positioning In this global digital financial architecture reconstruction, China's digital RMB (DCEP) strategy is particularly important. China actually adopts a hybrid model: On the one hand, DCEP maintains the absolute control of the central bank, which is consistent with the BIS unified ledger concept. On the other hand, China is also actively exploring the application of blockchain technology in financial infrastructure, including projects such as the Blockchain Service Network (BSN). More importantly, China is promoting the international use of the digital RMB through the Belt and Road Initiative. When the BIS's seven central bank alliances are designing a digital financial system dominated by the West, will China choose to join or build its own parallel system? From a technical perspective, the two-tier architecture of DCEP (central bank-commercial bank-user) is highly consistent with the design concept of the BIS unified ledger. But from a geopolitical perspective, China is more likely to promote the establishment of a regional digital payment system with the RMB as the core.   The ultimate balance between efficiency and control Let us speak with data. In traditional cross-border payment systems, nearly a quarter of global payment corridors cost more than 3%, and a third of retail cross-border payments take more than one business day to settle. In contrast, using USDC to transfer through Solana costs less than $0.01 and the settlement time does not exceed 5 seconds. The efficiency advantage of the public chain is obvious. But supporters of the BIS unified ledger will counter that efficiency is not the only criterion. Financial stability, monetary policy effectiveness, and anti-money laundering compliance are all systemic problems that public chains cannot solve. This is the core disagreement:  Between efficiency and control, how should we choose?     The battlefield of interoperability The deeper problem is interoperability. BIS proposes a \"single unified ledger\" model, while the public chain world advocates a \"multi-chain interconnection\" model. If the unified ledger is successful, how will it interact with the existing public chain ecosystem? Will it be completely isolated, or will some kind of bridge mechanism be established? Technically, the unified ledger can interact with the public chain to a limited extent through an oracle. But this requires the central bank to accept a certain degree of decentralization risk, which is exactly what they want to avoid the most. More likely, we will see two parallel financial universes: one is a permissioned network controlled by the central bank to handle large institutional transactions; the other is a decentralized public chain network that serves ordinary users and innovative applications.   Risks and opportunities coexist For Chinese financial institutions and investors, this \"unified ledger war\" is both a risk and an opportunity.  The risk is : If the unified ledger of the Western Central Bank Alliance becomes the global standard, and China chooses to build its own system, it may lead to the differentiation of financial infrastructure and increase cross-border transaction costs.  The opportunity is : China can use this window period to accelerate the international use of the digital RMB, especially in the countries along the \"Belt and Road\". At the same time, China's financial technology advantages can play an important role in the new digital financial architecture.   The financial map of the future By the end of 2025, when the BIS releases the final report of Project Agorá, we will see a clearer financial map of the future. There may be three main blocks on this map: the BIS unified ledger centered on the US dollar, the Chinese digital financial system centered on the RMB, and the continuously developing decentralized public chain ecosystem. For individuals and institutions, the key is to maintain flexibility between these three systems. The future winners will be those participants who can seamlessly switch between different digital financial tracks. In this game about the future of finance, technology is only a tool, and the real core is the redistribution of power. Regardless of the final outcome, we are witnessing an important turning point in the history of currency. At this turning point, China's choice will not only affect its own financial future, but will also profoundly affect the evolution of the global financial system.",
  "references": [
    "https://www.bis.org/press/p240403.htm",
    "https://www.bis.org/press/p250624.htm",
    "https://www.bis.org/about/bisih/topics/fmis/agora.htm",
    "https://cointelegraph.com/news/bis-project-agora-tokenized-deposits-cdc",
    "https://www.ledgerinsights.com/41-institutions-join-bis-tokenized-cross-border-payment-project-agora/",
    "https://www.centralbanking.com/central-banks/payments/7962290/bis-begins-design-phase-of-project-agora"
  ],
  "audio_file": "audio/en-US/macro/2025-07-03-bis-unified-ledger-battle.wav",
  "social_hook": "🚨 BREAKING: The world's most powerful central banks just launched a digital currency war against Bitcoin & Ethereum. BIS \"unified ledger\" vs. decentralized finance - who controls the future of money? 🏦⚡️🪙\n\nFull analysis: Eng | 中 | 日 podcasts on Apple Podcasts, Spotify",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-05T10:50:15.178Z"
}