{
  "id": "2025-07-15-treasury-stablecoin-shadow-money-system",
  "status": "social",
  "category": "macro",
  "date": "2025-07-15",
  "language": "zh-TW",
  "title": "當穩定幣成為「影子央行」：2600億美元的平行貨幣體系如何重塑全球金融",
  "content": "你有沒有想過，一個叫做 Tether 的公司，竟然持有比大多數國家還要多的美國國債？或者，每天在區塊鏈上流動的33萬億美元交易量，已經超過了 Visa 和 Mastercard 的總和？ 我們正在見證一場悄無聲息的金融革命。以美國國債為支撐的穩定幣，正在構建一個價值2600億美元的「影子貨幣體系」，它不僅改變了貨幣的定義，更可能重塑整個全球金融格局。 平行宇宙中的「央行」 讓我用一個簡單的比喻來解釋這個現象。想像傳統的美元體系是一個巨大的銀行，美聯儲是總行，各大商業銀行是分行，每一筆交易都需要通過這個龐大的系統進行清算和結算。 現在，穩定幣創造了一個「平行宇宙」的銀行系統。當你把100美元交給 Tether 或 Circle，他們不是把錢放在保險箱裡，而是立即去購買美國國債。然後，他們給你一張「數位收據」——穩定幣，這張收據可以在全球任何地方、任何時間進行交易，就像現金一樣。 這個看似簡單的過程，實際上創造了一種全新的貨幣形態。你手中的穩定幣不再是傳統意義上的「銀行存款」，而是一種「數位國債憑證」。它的價值不是由銀行信用支撐，而是由美國政府的信用支撐。 規模已經不容忽視 這個「影子貨幣體系」的規模已經達到了令人驚訝的程度。目前，USDT 和 USDC 等穩定幣的總流通量已經達到2200-2560億美元，約佔美國 M2 貨幣供應量的1%。 但更驚人的是它的使用頻率。傳統銀行存款的年周轉率大約是12次，而穩定幣的年周轉率高達150次。這意味著，雖然穩定幣只佔貨幣供應量的1%，但它們在實際交易中的重要性遠遠超過這個比例。 根據渣打銀行和美國財政部的預測，到2028年，穩定幣的總規模可能達到2萬億美元，佔美國 M2 的約9%。這相當於目前機構專用貨幣市場基金的規模。 歷史的鏡子：從「野貓銀行」到「歐洲美元」 這種現象在歷史上並不罕見。19世紀的美國曾經歷過「野貓銀行時代」，數千家州立銀行發行自己的紙幣，每張紙幣都有不同的信用等級，交易時需要打折扣。 更近的例子是20世紀60年代興起的「歐洲美元市場」。這是指存放在美國境外銀行的美元存款，它們脫離了美聯儲的直接控制，創造了一個巨大的離岸美元市場。 穩定幣可以說是「數位時代的歐洲美元」。它們同樣繞過了傳統的銀行體系，創造了一個全球性的美元流通網絡。但與歐洲美元不同的是，穩定幣不是存款，而是基於區塊鏈技術的數位資產，具有即時結算、可編程和全球可達的特點。 三個層次的系統性影響 穩定幣對金融系統的影響可以分為三個層次： 第一層：貨幣創造機制的變化 傳統的貨幣創造主要通過銀行放貸實現。銀行吸收存款，然後放貸給企業和個人，在這個過程中創造了新的貨幣。但穩定幣的機制完全不同：它們不是「創造」貨幣，而是「轉換」貨幣。 當有人用美元購買穩定幣時，底層的美元被用來購買國債，而穩定幣則成為一種新的支付工具。這相當於把原本「沉睡」在銀行系統中的資金，轉換成了高速流動的數位貨幣。 第二層：利率傳導機制的挑戰 美聯儲控制利率的傳統方式是通過影響銀行的放貸成本。但穩定幣的利率主要由短期國債收益率決定，而不是銀行間拆借利率。 這就像是在傳統的水管系統旁邊，建立了一套全新的供水系統。當美聯儲試圖調節水壓時，新系統可能不會完全同步響應，這就增加了貨幣政策的複雜性。 第三層：金融穩定的新風險 穩定幣的贖回機制與傳統銀行存款不同。當出現大規模贖回時，穩定幣發行方可能需要在短時間內拋售大量國債。考慮到目前穩定幣發行方持有的1500-2000億美元國債，這種「火燒連營」的風險不容小覷。 2020年3月，疫情爆發初期，連美國國債市場都出現了流動性危機，美聯儲不得不緊急干預。如果未來出現穩定幣大規模贖回，類似的危機可能會重演。 地緣政治的新武器 穩定幣的興起也有深刻的地緣政治含義。 對美國而言，穩定幣實際上加強了美元的全球霸權地位。過去，其他國家的央行和政府試圖通過「去美元化」來減少對美元的依賴。但穩定幣讓普通民眾可以輕鬆持有和使用美元，這使得政府層面的「去美元化」努力變得更加困難。 想像一下，如果一個國家的政府決定限制美元的使用，但民眾可以通過穩定幣輕鬆規避這些限制，那麼政府的政策效果就會大打折扣。 對其他國家而言，穩定幣可能導致「數位美元化」。當一個國家的公民和企業大量使用美元穩定幣進行交易時，該國央行的貨幣政策效果就會被削弱。這就像是在國家的貨幣系統中，插入了一個「外來的心臟」。 技術革命：「可編程貨幣」vs「啞巴貨幣」 穩定幣不僅僅是數位化的美元，它們是「可編程的貨幣」。這意味著它們可以與智能合約結合，實現自動化的金融服務。 比如，你可以設定一個智能合約，當你的穩定幣餘額超過1000美元時，自動將超出部分投資到某個 DeFi 協議中賺取利息。或者，你可以設定一個自動付款系統，每月自動從你的穩定幣帳戶中扣除房租。 這種「可編程性」是傳統銀行存款所不具備的。傳統的銀行存款更像是「啞巴貨幣」——它們只能被動地等待人工操作。 這種技術差異可能會導致金融系統的分化：一個是高效、自動化、全球互聯的「可編程貨幣」層，另一個是傳統的、需要人工干預的「啞巴貨幣」層。 監管的平衡術 面對穩定幣的快速發展，監管機構正在尋找一種平衡。他們既不想扼殺創新，也不想讓系統性風險失控。 最有可能的監管框架是「平行監管」——為穩定幣創建專門的監管規則，而不是簡單地套用現有的銀行或證券法規。 這個框架可能包括： 1. 準備金要求：要求穩定幣100%由高質量資產支撐，主要是短期國債和現金。 2. 贖回保證：保證持有者可以隨時按面值贖回穩定幣。 3. 透明度要求：定期公布準備金的詳細構成和審計報告。 4. 系統重要性監管：對大型穩定幣發行方實施類似銀行的審慎監管。 5. 國際協調：由於穩定幣的全球性，需要各國監管機構的協調合作。 未來的三種情境 根據我的分析，穩定幣的未來發展可能出現三種情境： 情境一：吸收情境 穩定幣成功地吸收了新發行的美國國債，幫助政府為赤字融資。在這種情況下，穩定幣發行方成為政府債務的重要買家，形成了一個「私人部門吸收公共赤字」的機制。 情境二：擠出情境 穩定幣與傳統的國債買家（如養老基金、保險公司、外國央行）競爭，可能扭曲收益率曲線，影響金融市場的正常運行。 情境三：危機情境 某個主要穩定幣發行方出現問題，引發大規模贖回，導致短期國債市場出現流動性危機。這可能需要美聯儲緊急干預，就像2020年3月那樣。 對普通人的實際影響 對於普通用戶來說，穩定幣的發展意味著什麼？ 好處： 1. 更便宜的跨境匯款：傳統匯款成本通常是6-14%，而穩定幣匯款成本只有0.05%。 2. 24/7 即時結算：不受銀行營業時間限制，可以隨時進行交易。 3. 金融包容性：即使沒有銀行帳戶，也可以通過穩定幣接入全球金融系統。 4. 可編程性：可以設置自動化的金融服務，如自動儲蓄、自動投資等。 風險： 1. 發行方風險：如果穩定幣發行方出現問題，用戶可能面臨損失。 2. 技術風險：智能合約漏洞、黑客攻擊等技術風險。 3. 監管風險：監管政策的變化可能影響穩定幣的使用。 4. 流動性風險：在極端情況下，可能出現無法及時贖回的情況。 投資者的新機會 對於投資者而言，穩定幣生態系統創造了一些新的機會： 1. 零息 vs 有息：可以選擇持有零息的穩定幣（如 USDT、USDC）進行交易，或持有有息的代幣化國債產品（如 tokenized T-bills）獲得收益。 2. 穩定幣發行方的股權：投資 Circle、Paxos 等穩定幣發行方的股權，分享其從國債收益中獲得的利潤。 3. 基礎設施投資：投資支持穩定幣生態系統的基礎設施，如區塊鏈網絡、錢包服務、支付處理等。 4. 套利機會：利用穩定幣與傳統金融產品之間的價差進行套利。 央行的反擊：CBDC 的加速 面對穩定幣的快速發展，各國央行正在加速推進央行數字貨幣（CBDC）的研發。 CBDC 可以看作是央行對私人穩定幣的「反擊」。它們提供了一種無風險的數字貨幣選擇，同時保持了央行對貨幣政策的完全控制。 但 CBDC 面臨著自己的挑戰：隱私保護、技術實現、國際協調等。而且，CBDC 的推出可能會影響商業銀行的存款基礎，這又會帶來新的金融穩定風險。 結語：進化，而非革命 穩定幣不是對現有金融系統的革命，而是一種進化。它們沒有推翻美元體系，反而可能加強了美元的全球地位。它們沒有消滅銀行，而是在銀行系統之外創建了一個更高效的支付和結算網絡。 這種進化的核心是「效率」。穩定幣提供了更快、更便宜、更便利的金融服務，這是它們成功的根本原因。 但效率的提升往往伴隨著風險的重新分配。穩定幣將某些風險從銀行系統轉移到了國債市場，將某些風險從政府轉移到了私人部門。 未來的金融系統可能會是一個混合體：傳統銀行處理複雜的信貸業務，穩定幣處理高頻的支付和結算，央行通過 CBDC 維持政策控制，三者共存、相互制衡。 在這個過程中，最重要的是保持適應性。無論你是投資者、政策制定者還是普通用戶，都需要理解這個新興的「影子貨幣體系」，並學會在其中找到自己的位置。 因為無論我們是否準備好，這個平行的金融宇宙已經在我們身邊悄然形成。它不會取代現有的金融系統，但它將與現有系統共存，並可能在某些領域超越它。 當你下次使用穩定幣時，請記住：你不僅僅是在使用一種數位貨幣，你還在參與一場正在改變全球金融格局的歷史性實驗。",
  "references": [
    "https://www.panewslab.com/zh/articles/t2k8r910rj8m",
    "https://www.standardchartered.com/en/news-and-insights/",
    "https://www.treasury.gov/resource-center/data-chart-center/quarterly-refunding/",
    "https://www.federalreserve.gov/monetarypolicy/",
    "https://www.bis.org/publ/work905.pdf",
    "https://www.imf.org/en/Publications/",
    "https://www.financialstabilityboard.org/publications/",
    "https://www.brookings.edu/research/",
    "https://www.bankofengland.co.uk/quarterly-bulletin/",
    "https://www.ecb.europa.eu/pub/economic-research/"
  ],
  "audio_file": "audio/zh-TW/macro/2025-07-15-treasury-stablecoin-shadow-money-system.wav",
  "social_hook": "🚨 震撼：Tether 持有美債比多數國家還多！穩定幣構建2600億美元「影子央行」，日交易33萬億超越 Visa + Mastercard。金融革命正重塑世界 📱 Eng | 中 | 日 播客：Apple Podcasts、Spotify",
  "feedback": {
    "content_review": {
      "status": "accepted",
      "score": 4,
      "reviewer": "reviewer_cli",
      "timestamp": "2025-07-16T06:11:18.059Z",
      "comments": "可以解釋壹下什麼事 M2 會更好，但野貓銀行時代的那個知識點非常棒，容易理解而且是新知"
    }
  },
  "updated_at": "2025-07-16T06:28:27.587Z",
  "streaming_urls": {
    "wav": "https://mock-r2.fromfedtochain.com/audio/zh-TW/macro/2025-07-15-treasury-stablecoin-shadow-money-system/audio.wav",
    "m3u8": null,
    "segments": []
  },
  "mock_data": true,
  "mock_generated_at": "2025-07-15T22:52:18.624Z"
}